const allProducts = [
    {
        id: '1',
        category: 'phones',
        name: 'iphone11',
        description: 'iPhone 11, як і попередники Apple - неймовірний смартфон, який підкорює з першого погляду. У ньому все ідеально: будь-яка найдрібніша деталь говорить про бездоганну технологічность, укладену в тонкому і стильному корпусі.  Він втілює в собі все, що все так люблять в iPhone - надзвичайно потужний процесор, чудовий Liquid Retina HD дисплей з приголомшливою передачею кольорів, ідеальну подвійну камеру і модуль бездротової зарядки Qi.',
        price: '17973',
        img: require('../images/iphone11.png')
    },
    {
        id: '2',
        category: 'phones',
        name: 'iphone12',
        description: 'ЗУСТРІЧАЙТЕ, IPHONE 12 - АБСОЛЮТНО НОВИЙ РІВЕНЬ! Вересень. 2020 рік. Довгоочікувана осіння презентація. Компанія Apple радувала нас в цьому році великою кількістю новинок - це і нові iPad Pro, оновлені MacBook Pro, MacBook Air, неймовірний Mac Pro і інші гаджети та аксесуари до них. Але найголовніша новинка року була представлена ​​саме 13.10.2020. 12-й iPhone порадував всіх шанувальників яблучної техніки і здивував всіх супротивників, яких з кожним роком стає все менше і менше. Неймовірний дисплей, вдосконалений процесор, ультрасучасна камера, що складається з декількох модулів, як завжди матеріали найвищої якості і безліч інших інноваційних технологій, які вразять кожного. Будь першим!',
        price: '24615',
        img: require('../images/iphone12.png')
    },
    {
        id: '3',
        category: 'phones',
        name: 'iphone13',
        description: 'Сміливо можна відмовлятися від великих і незручних напівпрофесійних камер, адже новий IPHONE 13 має дивовижні можливості фото і відеозйомки. І це не жарти! ми могли б поставити багато знаків оклику і написати текст «капсом», але навіть і це не відобразити все наше захоплення він нових можливостей. Абсолютно новий підхід до розташування камер дозволив помістити в корпус найсучасніший об`єктив, який можна лише уявити. Крім того, тут знайшлося місце і для системи оптичної стабілізації зображення зі зсувом матриці. Тепер камера бачить більше дрібних деталей навіть на темних знімках. Вона вловлює на 47% більше світла, роблячи фотографії більш якісними та чіткими.',
        price: '28522',
        img: require('../images/iphone13.png')
    },
    {
        id: '4',
        category: 'phones',
        name: 'iphone14',
        description: 'Приголомшливий час автономної роботи нового iPhone 14 протягом усього дня з відтворенням відео до 20 годин.Аварійний сигнал SOS через супутник та виявлення зіткнень – новаторські функції, розроблені для порятунку життів. Тепер користувачі iPhone при екстреній ситуації можуть скористатися функцією зв`язку через супутник, щоб передати інформацію про своє місцеперебування. Дисплей Super Retina XDR – чіткий, яскравий та яскравий! Використання такого гаджета приноситиме виняткове естетичне задоволення його власнику. ',
        price: '32703',
        img: require('../images/iphone14.png')
    },
    {
        id: '5',
        category: 'macbooks',
        name: 'Mac Mini',
        description: 'Mac mini с M2 имеет необходимую скорость, чтобы делать побыстрее. А M2 Pro выводит это на совершенно новый уровень – впервые вводит профессиональный чип на Mac mini. Добавьте к этому разнообразный набор портов, и вы получите рабочий стол, готовый к любым настройкам, вне зависимости от того, какой чип вы выберете.',
        price: '37 558',
        img: require('../images/macmini.png')
    },
    {
        id: '6',
        category: 'macbooks',
        name: 'MacBook Air 13',
        description: 'Тонкий, легкий, с новым процессором М1 и еще мощнее. С первого взгляда, внешне MacBook Air ничем не изменился, если сравнивать с предыдущей моделью. Уже полюбившийся всем дисплей Retina, все та же чувствительная клавиатура Magic Keyboard, функция Touch ID, в 3.5 раза производительней процессор, графической системой и еще вместительней накопителем, Thunderbolt 4, поддержка Wi-Fi 6, MacBook Air с чипом М1 2020 покоряет с первого взгляда, а работа на нем – сплошное удовольствие',
        price: '35 399',
        img: require('../images/macbookair13.png')
    },
    {
        id: '7',
        category: 'macbooks',
        name: 'iMac 24" Retina 4,5K',
        description: 'Словно супергерой среди компьютеров, новенький iMac превзошел все ожидания публики и произвел настоящий фурор на презентации 2021-го года. Он элегантен в каждом изгибе и точен в каждом вычислении, а цветовые решения позволяют ему найти свое место в любой обстановке.',
        price: '66 118',
        img: require('../images/imac24.png')
    },
    {
        id: '8',
        category: 'macbooks',
        name: 'iMac 24" Retina 4,5K',
        description: 'Словно супергерой среди компьютеров, новенький iMac превзошел все ожидания публики и произвел настоящий фурор на презентации 2021-го года. Он элегантен в каждом изгибе и точен в каждом вычислении, а цветовые решения позволяют ему найти свое место в любой обстановке.',
        price: '66 118',
        img: require('../images/imac24.png')
    },
    {
        id: '9',
        category: 'watches',
        name: 'Apple Watch Series 8',
        description: 'Apple Watch Series 8 – это часы с передовыми датчиками и приложениями для здоровья. Все главные конфигурации сосредоточены внутри. И они вас удивят!',
        price: '17410',
        img: require('../images/applewatch8.png')
    },
    {
        id: '10',
        category: 'watches',
        name: 'Apple Watch Ultra 49mm',
        description: 'Вдохновившись самыми экстремальными видами деятельности, Apple представляет революционно новый дизайн с революционными возможностями. Apple Watch Ultra представляют собой титановый корпус диаметром 49 мм и плоское переднее стекло сапфировое, сквозь которое открывается самый большой и яркий дисплей Apple Watch.',
        price: '31298',
        img: require('../images/applewatchultra.png')
    },
    {
        id: '11',
        category: 'watches',
        name: 'Apple Watch SE',
        description: 'АК ВЫГЛЯДИТ ЗАБОТА И ЛЮБОВЬ! Три стильных цвета корпуса. Мощные датчики для понимания вашего здоровья и физической формы. Инновационные функции безопасности. Удобные способы оставаться на связи. Более быстрый двухъядерный процессор для дополнительной производительности. Apple Watch SE многофункциональны, и теперь они выгоднее, чем когда-либо. Датчик температуры Инновационный новый датчик дает представление о вашем общем самочувствии и включает расширенные функции отслеживания цикла.',
        price: '11346 ',
        img: require('../images/applewatchse.png')
    },
];


export default allProducts